#Задача 5. Разворот
str_input = input("Введите строку: ")
print("Развёрнутая последовательность между первым и последним h: ", end = '')
